{
  "backend/main.mo": "Actor implementing user profiles with access control and a per‑game high‑score system supporting score submission, top score queries, and user best‑score lookup.",
  "feature_evidence.json": "Feature evidence report mapping category‑grouping hub updates and filtered category rendering to affected frontend files and components.",
  "frontend-file-summaries.txt": "Collection of short summaries describing each frontend file's purpose, including layout, hooks, pages, components, and game logic.",
  "frontend/index.css": "Global Tailwind base definitions with light/dark theme CSS variables and utility resets.",
  "frontend/index.html": "Root HTML file mounting the React app and loading the main module.",
  "frontend/src/App.tsx": "Top‑level app handling hash‑based routing and wrapping pages with layout, theming, and profile setup.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button managing Internet Identity authentication and clearing cached queries.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Modal dialog prompting authenticated users without a profile to enter and save their display name.",
  "frontend/src/components/branding/BrandHeader.tsx": "Header component showing the GameHub logo and welcome text.",
  "frontend/src/components/hub/CategorySection.tsx": "Renders a category heading and grid of game cards, hidden if the category has no games.",
  "frontend/src/components/hub/GameCard.tsx": "Displays a game's icon, metadata badges, description, and a play or coming‑soon button.",
  "frontend/src/components/icons/GameCategoryIcon.tsx": "Renders a category icon from a sprite sheet using computed background offsets.",
  "frontend/src/components/layout/AppHeader.tsx": "Header component with navigation, game branding, and user auth display.",
  "frontend/src/components/layout/AppLayout.tsx": "App layout wrapper providing header, main content container, and footer.",
  "frontend/src/components/leaderboards/LeaderboardPanel.tsx": "Leaderboard panel showing top scores for a game and highlighting the current user.",
  "frontend/src/gameRegistry.ts": "Registry of game metadata including IDs, titles, categories, and playability.",
  "frontend/src/games/comingSoon/ComingSoonGame.tsx": "Placeholder card for unreleased games with a coming soon message.",
  "frontend/src/games/reaction/ReactionTimerGame.tsx": "Reaction timer game handling timing logic, scoring, and score submission.",
  "frontend/src/games/ticTacToe/TicTacToeGame.tsx": "Tic‑Tac‑Toe game with win detection, turn handling, and score submission.",
  "frontend/src/games/word/WordScrambleGame.tsx": "Implements a timed word‑scramble game with scoring, round management, and score submission via hooks.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, invalidating queries when identity changes.",
  "frontend/src/hooks/useAuthStatus.ts": "Exposes authentication state, principal string, and login status derived from Internet Identity.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity login, stored identities, and AuthClient setup.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for user profiles, top scores, best scores, and score submission using the backend actor.",
  "frontend/src/index.css": "Defines Tailwind base styles and theme variables for light/dark modes and utility classes for game UI.",
  "frontend/src/main.tsx": "Bootstraps the app with React, wrapping it in query and identity providers.",
  "frontend/src/pages/AllLeaderboardsPage.tsx": "Renders a list of all playable games with navigation links to each leaderboard.",
  "frontend/src/pages/GameShellPage.tsx": "Loads game metadata, renders the selected game component, and displays its leaderboard panel.",
  "frontend/src/pages/HubPage.tsx": "Renders the main game hub with search, category filtering, and grouped or grid views of games, using GAME_REGISTRY for data and navigation via hash routing.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, storing, persisting, and clearing URL and session parameters, supporting both query and hash-based routing.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom theme values, animations, colors, fonts, and plugins for typography, container queries, and animations.",
  "project_state.json": "Describes the project’s current state, features, and requirements for expanding a multi‑game hub up to 50 games with navigation, theming, and user features."
}