{
  "kind": "build_request",
  "title": "Group the hub game catalog into simple category sections",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-13",
      "text": "Update the Hub page to support grouped browsing by game category: when viewing \"All Categories\", render games grouped into distinct category sections (one section per `game.category`) with a clear category heading and per-section game list/grid; keep existing search behavior and ensure category grouping updates dynamically based on the current search query.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Want to sort the games into simple categories next?",
          "Yes"
        ]
      },
      "acceptanceCriteria": [
        "On the Hub page, selecting \"All Categories\" displays separate sections for each category present in `GAME_REGISTRY` (e.g., Puzzle, Arcade, Strategy, Word, Card, Math).",
        "Each category section has a visible heading and only shows games that match the current search query.",
        "If the current search query results in no games for a category, that category section is hidden.",
        "The overall games shown in grouped view matches the same set that would have been shown by the existing filtering logic for the current search query."
      ]
    },
    {
      "id": "REQ-14",
      "text": "When a specific category is selected in the existing category filter (not \"all\"), render a single category section for that category (or a single ungrouped list) while preserving the existing game-card UI, play/coming-soon behavior, and result count messaging.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Want to sort the games into simple categories next?",
          "Yes"
        ]
      },
      "acceptanceCriteria": [
        "Selecting a specific category in the filter restricts the hub to only games in that category, still respecting the search query.",
        "The UI continues to show each game card with its category badge, optional difficulty badge, optional tag badges, and the Play/Coming Soon button behavior unchanged.",
        "The \"Showing X games\" count remains accurate for both grouped and single-category views."
      ]
    }
  ],
  "constraints": [
    "Frontend must not modify files under `frontend/src/hooks/useInternetIdentity.ts`, `frontend/src/hooks/useInternetIdentity.tsx`, `frontend/src/hooks/useActor.ts`, `frontend/src/main.tsx`, or anything in `frontend/src/components/ui` (compose instead of editing).",
    "Do not add new backend canisters or change the single-actor backend architecture."
  ],
  "nonGoals": [
    "No backend changes to scores, profiles, or leaderboard storage/retrieval.",
    "No new game implementations; only hub organization/presentation changes.",
    "No changes to the existing game registry schema beyond what already exists (category/tags/difficulty)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}