{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Group Hub game catalog into category sections",
  "requirements": [
    {
      "id": "REQ-13",
      "summary": "On the Hub page, when \"All Categories\" is selected, render the search-filtered games grouped into per-category sections with headings, hiding empty sections while keeping existing search behavior.",
      "acceptanceCriteria": [
        "On the Hub page, selecting \"All Categories\" displays separate sections for each category present in `GAME_REGISTRY` (e.g., Puzzle, Arcade, Strategy, Word, Card, Math).",
        "Each category section has a visible heading and only shows games that match the current search query.",
        "If the current search query results in no games for a category, that category section is hidden.",
        "The overall games shown in grouped view matches the same set that would have been shown by the existing filtering logic for the current search query."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/hub/GameCard.tsx",
          "operation": "create",
          "description": "Extract the existing Hub game-card UI into a reusable component (category badge, optional difficulty + tag badges, and Play/Coming Soon button behavior), preserving the current look/behavior exactly."
        },
        {
          "path": "frontend/src/components/hub/CategorySection.tsx",
          "operation": "create",
          "description": "Create a presentational section component that renders a clear category heading and a per-section list/grid container for game cards; accepts a category label and a list of games to display."
        },
        {
          "path": "frontend/src/pages/HubPage.tsx",
          "operation": "modify",
          "description": "Update Hub page rendering logic so when selectedCategory is \"all\" it: (1) applies the current search filter across the full registry, (2) groups the resulting games by `game.category`, (3) renders one CategorySection per category that has at least one matching game, and (4) ensures the set of displayed games matches the existing filter results for the current search query."
        }
      ]
    },
    {
      "id": "REQ-14",
      "summary": "When a specific category is selected, render a single-category view (single section or ungrouped grid) while preserving the existing card UI, play/coming-soon behavior, and accurate result count messaging.",
      "acceptanceCriteria": [
        "Selecting a specific category in the filter restricts the hub to only games in that category, still respecting the search query.",
        "The UI continues to show each game card with its category badge, optional difficulty badge, optional tag badges, and the Play/Coming Soon button behavior unchanged.",
        "The \"Showing X games\" count remains accurate for both grouped and single-category views."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/HubPage.tsx",
          "operation": "modify",
          "description": "Adjust Hub page logic so when a specific category is selected it renders only that category’s search-filtered games (as a single section or the existing ungrouped grid), reusing the extracted GameCard to keep UI/behavior unchanged, and keep the \"Showing X games\" count accurate for both grouped and single-category modes."
        }
      ]
    }
  ]
}